dustinreynolds/STM32Examples/RTC_DS3231/src/i2c.c
/*
 * i2c.c
 *
 *  Created on: Jun 7, 2015
 *      Author: Dustin
 *
 * Copyright (c) 2015, Dustin Reynolds
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright notice, this
 *   list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 *
 * * Neither the name of [project] nor the names of its
 *   contributors may be used to endorse or promote products derived from
 *   this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "stm32l1xx_i2c.h"
#include "string.h"
#include "i2c.h"

void _i2c_start_address(I2C_TypeDef* I2Cx, uint8_t address, uint8_t I2C_Direction);
void _i2c_stop(I2C_TypeDef* I2Cx);
void _i2c_write(I2C_TypeDef* I2Cx, uint8_t byte);
void _i2c_read(I2C_TypeDef* I2Cx, uint8_t ack, uint8_t * byte);

void i2c_init(void){
	I2C_InitTypeDef I2C_InitStructure;

	I2C_StructInit(&I2C_InitStructure);

	I2C_InitStructure.I2C_ClockSpeed = 100000;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;

	I2C_Init(I2C2, &I2C_InitStructure);

	I2C_Cmd(I2C2, ENABLE);
}

void i2c_ds3231_reset(I2C_TypeDef* I2Cx){
	uint32_t count = 0;
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);


	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	//Toggle SCL until SDA is in a high state
	while(count < 100000){
		if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11) == 1){
			break;
		}
		GPIOB->ODR ^= GPIO_Pin_10; //toggle SCL
		delayms(1);
	}

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C2);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C2);
}

void i2c_ds3231_init(I2C_TypeDef* I2Cx){
	uint8_t control_reg = 0x00;

	control_reg = DS3231_CONTROL_RS2 | DS3231_CONTROL_RS1 | DS3231_CONTROL_INTCN;
	i2c_ds3231_write_reg(I2Cx, DS3231_CONTROL_REG, control_reg);
}
void i2c_ds3231_set_address(I2C_TypeDef* I2Cx, uint8_t address){
	_i2c_start_address(I2Cx, DS3231_I2C_ADDR,I2C_Direction_Transmitter);
	_i2c_write(I2Cx, address);
	_i2c_stop(I2Cx);
}

void i2c_ds3231_write_reg(I2C_TypeDef* I2Cx, uint8_t address, uint8_t value){
	_i2c_start_address(I2Cx, DS3231_I2C_ADDR,I2C_Direction_Transmitter);
	_i2c_write(I2Cx, address);
	_i2c_write(I2Cx, value);
	_i2c_stop(I2Cx);
}

void i2c_ds3231_write_registers(I2C_TypeDef* I2Cx, uint8_t address, uint8_t * data, uint8_t count){
	_i2c_start_address(I2Cx, DS3231_I2C_ADDR,I2C_Direction_Transmitter);
	_i2c_write(I2Cx, address);
	while (count-- > 0)
		_i2c_write(I2Cx, *data++);
	_i2c_stop(I2Cx);
}

void i2c_ds3231_read_register(I2C_TypeDef* I2Cx, uint8_t address, uint8_t * value){
	i2c_ds3231_set_address(I2Cx, address);

	_i2c_start_address(I2Cx, DS3231_I2C_ADDR,I2C_Direction_Receiver);
	_i2c_read(I2Cx, NACK, value);
}

void i2c_ds3231_read_registers(I2C_TypeDef* I2Cx, uint8_t address, uint8_t * data, uint8_t count){
	i2c_ds3231_set_address(I2Cx, address);

	_i2c_start_address(I2Cx, DS3231_I2C_ADDR,I2C_Direction_Receiver);
	while (--count > 0)
		_i2c_read(I2Cx, ACK, data++);
	_i2c_read(I2Cx, NACK, data);
}

unsigned char i2c_ds3231_logic_test(DS3231_time_t time, DS3231_date_t date){
	//Function to quickly test if we can get data into correct form and out of form
	DS3231_time_t time2;
	DS3231_date_t date2;
	unsigned char temp[8], reg;
	unsigned char result = 0;

	//Write to registers
	reg = ((time.seconds / 10) << 4 ) | time.seconds % 10;
	temp[0] = reg;

	reg = ((time.minutes / 10) << 4 ) | time.minutes % 10;
	temp[1] = reg;

	if(time.is_ampm_time){
		reg = (time.is_ampm_time << 6) | (time.am_pm << 5) | ((time.hours / 10) << 4 ) | time.hours % 10;
	}else{
		reg = (time.is_ampm_time << 6) | ((time.hours / 10) << 4 ) | time.hours % 10;
	}
	temp[2] = reg;

	reg = date.day;
	temp[3] = reg;

	reg = ((date.date / 10) << 4 ) | date.date % 10;
	temp[4] = reg;

	reg = ((date.month / 10) << 4) | date.month % 10;
	temp[5] = reg;

	reg = ((date.year / 10) << 4) | date.year % 10;
	temp[6] = reg;

	//read from registers
	time2.seconds = ((temp[0] & 0x70) >> 4) * 10 + (temp[0] & 0x0F);
	time2.minutes = ((temp[1] & 0x70) >> 4) * 10 + (temp[1] & 0x0F);
	if ((temp[2] & 0x40) > 0){
		time2.is_ampm_time = 1;
		time2.am_pm = (temp[2] & 0x20) >> 5;
		time2.hours = ((temp[2] & 0x10) >> 4) * 10 + (temp[2] & 0x0F);
	}else{
		time2.is_ampm_time = 0;
		time2.am_pm = 0;
		time2.hours = ((temp[2] & 0x30) >> 4) * 10 + (temp[2] & 0x0F);
	}

	date2.day = temp[3];
	date2.date = ((temp[4] & 0x30 ) >> 4) * 10 + (temp[4] & 0x0F);

	date2.month = ((temp[5] & 0x10 ) >> 4 ) * 10 + (temp[5] & 0x0F);
	date2.year = ((temp[6] & 0xFF) >> 4 ) * 10 + (temp[6] & 0x0F);

	//Test logic
	if (time.seconds != time2.seconds){
		printf("Seconds: %02d vs %02d, temp %02x", time.seconds, time2.seconds, temp[0]);
		result++;
	}if (time.minutes != time2.minutes){
		printf("minutes: %02d vs %02d, temp %02x", time.minutes, time2.minutes,temp[1]);
		result++;
	}if (time.hours != time2.hours){
		printf("hours: %02d vs %02d, temp %02x", time.hours, time2.hours,temp[2]);
		result++;
	}if (time.am_pm != time2.am_pm){
		printf("am_pm: %02d vs %02d, temp %02x", time.am_pm, time2.am_pm, temp[2]);
		result++;
	}if (time.is_ampm_time != time2.is_ampm_time){
		printf("ampm: %02d vs %02d, temp %02x", time.is_ampm_time, time2.is_ampm_time,temp[2]);
		result++;
	}

