dustinreynolds/STM32Examples/RTC_DS3231/src/i2c.c
	if (date.day != date2.day){
		printf("day: %02d vs %02d, temp %02x", date.day, date2.day,temp[3]);
		result++;
	}if (date.date != date2.date){
		printf("date: %02d vs %02d, temp %02x", date.date, date2.date,temp[4]);
		result++;
	}if (date.month != date2.month){
		printf("month: %02d vs %02d, temp %02x", date.month, date2.month,temp[5]);
		result++;
	}if (date.year != date2.year){
		printf("year: %02d vs %02d, temp %02x", date.year, date2.year,temp[6]);
		result++;
	}
	return result;
}

uint8_t i2c_ds3231_test(void){
	//test all possible combinations of date and time
	//this takes a long time even for desktop processors

	uint8_t result = 0;
	uint8_t ts,tm,th,ta,ti;  //time
	uint8_t day,da,dm,dy;  //date
	unsigned long long iteration = 0;
	DS3231_time_t time;
	DS3231_date_t date;

	for(dy=0; dy<1;dy++){
		for(dm=1; dm < 13; dm++){
			for(da=1; da<32; da++){
				for(day=1;day<8;day++){
					//am_pm
					for(ti=1,ta=0;ta<2;ta++){
						for(th=1;th < 13;th++){
							for(tm=0;tm<60;tm++){
								for(ts=0;ts<60;ts++){
									time.seconds = ts;
									time.minutes = tm;
									time.hours = th;
									time.is_ampm_time = ti;
									time.am_pm = ta;
									date.day = day;
									date.date = da;
									date.month = dm;
									date.year = dy;
									result = i2c_ds3231_logic_test(time, date);
									if (result > 0){
										result = i2c_ds3231_logic_test(time, date);
										printf("result %d y %02d m %02d date %02d day %02d",result, dy,dm,da,day);
										printf(" h %02d m %02d s %02d  is_ampm %02d am_pm %02d\r\n", th,tm,ts,ti,ta);
										return 1;
									}
									iteration++;
								}
							}
						}
					}
					//24hr
					for(ti=0,th=0;th<24;th++){
						for(tm=0;tm<60;tm++){
							for(ts=0;ts<60;ts++){
								time.seconds = ts;
								time.minutes = tm;
								time.hours = th;
								time.is_ampm_time = ti;
								time.am_pm = 0;
								date.day = day;
								date.date = da;
								date.month = dm;
								date.year = dy;
								result = i2c_ds3231_logic_test(time, date);
								if (result > 0){
									result = i2c_ds3231_logic_test(time, date);
									printf("result %d y %02d m %02d date %02d day %02d",result, dy,dm,da,day);
									printf(" h %02d m %02d s %02d  is_ampm %02d am_pm %02d\r\n", th,tm,ts,ti,ta);
									return 1;
								}
								iteration++;
							}
						}
					}
				}
			}
			printf("Iterations %d",iteration);
			printf(" y %02d m %02d date %02d day %02d",dy,dm,da,day);
			printf(" h %02d m %02d s %02d  is_ampm %02d am_pm %02d\r\n", th,tm,ts,ti,ta);
		}
	}

	return 0;
}

void i2c_ds3231_set_time_date(I2C_TypeDef* I2Cx, DS3231_time_t time, DS3231_date_t date){
	uint8_t reg;

	//Write to registers
	reg = ((time.seconds / 10) << 4 ) | time.seconds % 10;
	i2c_ds3231_write_reg(I2Cx,DS3231_SECONDS_REG, reg);

	reg = ((time.minutes / 10) << 4 ) | time.minutes % 10;
	i2c_ds3231_write_reg(I2Cx,DS3231_MINUTES_REG, reg);

	if(time.is_ampm_time){
		reg = (time.is_ampm_time << 6) | (time.am_pm << 5) | ((time.hours / 10) << 4 ) | time.hours % 10;
	}else{
		reg = (time.is_ampm_time << 6) | ((time.hours / 10) << 4 ) | time.hours % 10;
	}
	i2c_ds3231_write_reg(I2Cx,DS3231_HOUR_REG, reg);

	reg = date.day;
	i2c_ds3231_write_reg(I2Cx,DS3231_DAY_REG, reg);

	reg = ((date.date / 10) << 4 ) | date.date % 10;
	i2c_ds3231_write_reg(I2Cx,DS3231_DATE_REG, reg);

	reg = ((date.month / 10) << 4) | date.month % 10;
	i2c_ds3231_write_reg(I2Cx,DS3231_MONTH_REG, reg);

	reg = ((date.year / 10) << 4) | date.year % 10;
	i2c_ds3231_write_reg(I2Cx,DS3231_YEAR_REG, reg);
}

void i2c_ds3231_read_time_date(I2C_TypeDef* I2Cx, DS3231_time_t * time, DS3231_date_t * date){
	uint8_t temp[7];
	i2c_ds3231_read_registers(I2Cx, 0x00, temp, 7);

	time->seconds = ((temp[0] & 0x70) >> 4) * 10 + (temp[0] & 0x0F);
	time->minutes = ((temp[1] & 0x70) >> 4) * 10 + (temp[1] & 0x0F);
	if ((temp[2] & 0x40) > 0){
		time->is_ampm_time = 1;
		time->am_pm = (temp[2] & 0x20) >> 5;
		time->hours = ((temp[2] & 0x10) >> 4) * 10 + (temp[2] & 0x0F);
	}else{
		time->is_ampm_time = 0;
		time->am_pm = 0;
		time->hours = ((temp[2] & 0x30) >> 4) * 10 + (temp[2] & 0x0F);
	}

	date->day = temp[3];
	date->date = ((temp[4] & 0x30 ) >> 4) * 10 + (temp[4] & 0x0F);

	date->month = ((temp[5] & 0x10 ) >> 4 ) * 10 + (temp[5] & 0x0F);
	date->year = ((temp[6] & 0xFF) >> 4 ) * 10 + (temp[6] & 0x0F);
}

float i2c_ds3231_read_temperature(I2C_TypeDef* I2Cx){
	uint8_t temp[2];
	float temperature;
	i2c_ds3231_read_registers(I2Cx, DS3231_MSB_TEMP_REG, temp, 2);

	//http://ideone.com/seM4DH
	if ((temp[0] & 0x80) > 0){
		temperature = (char)temp[0] + ((float)(temp[1] >> 6))/4.0;
	}else{
		temperature = temp[0] + ((float)(temp[1] >> 6))/4.0;
	}
	return temperature;
}

void i2c_ds3231_set_alarm_1(I2C_TypeDef* I2Cx, DS3231_alarm_t alarm){
	//given alarm settings, set alarm accordingly
	uint8_t temp[4];

	temp[0] = (alarm.AMx[0] << 7) | ((alarm.seconds / 10) << 4 ) | alarm.seconds % 10;
	temp[1] = (alarm.AMx[1] << 7) | ((alarm.minutes / 10) << 4 ) | alarm.minutes % 10;
	if(alarm.is_ampm_time){
		temp[2] = (alarm.AMx[2] << 7) | (alarm.is_ampm_time << 6) | (alarm.am_pm << 5) | ((alarm.hours / 10) << 4 ) | alarm.hours % 10;
	}else{
		temp[2] = (alarm.AMx[2] << 7) | (alarm.is_ampm_time << 6) | ((alarm.hours / 10) << 4 ) | alarm.hours % 10;
	}

	if(alarm.day_or_date){
		temp[3] = (alarm.AMx[3] << 7) | (alarm.day_or_date << 6) | alarm.day;
	}else{
		temp[3] = (alarm.AMx[3] << 7) | (alarm.day_or_date << 6) | ((alarm.date / 10) << 4 ) | alarm.date % 10;
	}

	i2c_ds3231_write_registers(I2Cx, DS3231_ALARM_1_SECONDS_REG, temp, 4);
}

void i2c_ds3231_set_alarm_2(I2C_TypeDef* I2Cx, DS3231_alarm_t alarm){
	//given alarm settings, set alarm accordingly
	uint8_t temp[3];

	temp[0] = (alarm.AMx[1] << 7) | ((alarm.minutes / 10) << 4 ) | alarm.minutes % 10;
	if(alarm.is_ampm_time){
		temp[1] = (alarm.AMx[2] << 7) | (alarm.is_ampm_time << 6) | (alarm.am_pm << 5) | ((alarm.hours / 10) << 4 ) | alarm.hours % 10;
	}else{
		temp[1] = (alarm.AMx[2] << 7) | (alarm.is_ampm_time << 6) | ((alarm.hours / 10) << 4 ) | alarm.hours % 10;
	}

