dustinreynolds/STM32Examples/RTC_DS3231/src/i2c.c
	if(alarm.day_or_date){
		temp[2] = (alarm.AMx[3] << 7) | (alarm.day_or_date << 6) | alarm.day;
	}else{
		temp[2] = (alarm.AMx[3] << 7) | (alarm.day_or_date << 6) | ((alarm.date / 10) << 4 ) | alarm.date % 10;
	}

	i2c_ds3231_write_registers(I2Cx, DS3231_ALARM_2_MINUTES_REG, temp, 3);
}

uint8_t i2c_ds3231_check_alarm_1(I2C_TypeDef* I2Cx){
	uint8_t temp;
	i2c_ds3231_read_register(I2Cx, DS3231_CONTROL_STATUS_REG, &temp);

	if ((temp & DS3231_CONTROL_STATUS_ALARM_1_FLAG) > 0){
		//clear flag
		temp = temp & ~DS3231_CONTROL_STATUS_ALARM_1_FLAG; //check this
		i2c_ds3231_write_reg(I2Cx, DS3231_CONTROL_STATUS_REG,temp);

		return 1;
	}
	return 0;
}
uint8_t i2c_ds3231_check_alarm_2(I2C_TypeDef* I2Cx){
	uint8_t temp;
	i2c_ds3231_read_register(I2Cx, DS3231_CONTROL_STATUS_REG, &temp);

	if ((temp & DS3231_CONTROL_STATUS_ALARM_2_FLAG) > 0){
		//clear flag
		temp = temp & ~DS3231_CONTROL_STATUS_ALARM_2_FLAG; //check this
		i2c_ds3231_write_reg(I2Cx, DS3231_CONTROL_STATUS_REG,temp);

		return 1;
	}
	return 0;
}

uint8_t i2c_ds3231_test_rtc(I2C_TypeDef* I2Cx){
	DS3231_time_t time1, time2;
	DS3231_date_t date1, date2;
	uint8_t result = 0;

	time1.seconds = 0;
	time1.minutes = 2;
	time1.hours = 9;
	time1.is_ampm_time = 0;
	time1.am_pm = 0;
	date1.day = 1;
	date1.date = 14;
	date1.month = 6;
	date1.year = 15;
	i2c_ds3231_set_time_date(I2Cx, time1, date1);

	delayms(2100);

	i2c_ds3231_read_time_date(I2Cx, &time2, &date2);

	if(time2.seconds != (time1.seconds + 2) ){
		result++;
	}if(time2.minutes != time1.minutes){
		result++;
	}if(time2.hours != time1.hours){
		result++;
	}if(time2.is_ampm_time != time1.is_ampm_time){
		result++;
	}if(time2.am_pm != time1.am_pm){
		result++;
	}if(date2.day != date1.day){
		result++;
	}if(date2.date != date1.date){
		result++;
	}if(date2.month != date1.month){
		result++;
	}if(date2.year != date1.year){
		result++;
	}

	if (result)
		return result;
	//Test Alarm 1 and 2
	{
		{ //Test once a second alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 0;
			time1.minutes = 2;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = time1.seconds+1;
			alarm1.minutes = time1.minutes;
			alarm1.hours = time1.hours;
			alarm1.am_pm = time1.am_pm;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day;
			alarm1.date = date1.date;
			alarm1.AMx[0] = 1; alarm1.AMx[1] = 1;alarm1.AMx[2] = 1;alarm1.AMx[3] = 1;
			alarm1.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states
			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 once a second %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}

		}

		{ //Test seconds match alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 1;
			time1.minutes = 2;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = time1.seconds+1;
			alarm1.minutes = time1.minutes;
			alarm1.hours = time1.hours;
			alarm1.am_pm = time1.am_pm;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day;
			alarm1.date = date1.date;
			alarm1.AMx[0] = 0; alarm1.AMx[1] = 1;alarm1.AMx[2] = 1;alarm1.AMx[3] = 1;
			alarm1.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 seconds match %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test minutes and seconds match alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 59;
			time1.minutes = 2;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = 0;
			alarm1.minutes = time1.minutes+1;
			alarm1.hours = time1.hours;
			alarm1.am_pm = time1.am_pm;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day;
			alarm1.date = date1.date;
			alarm1.AMx[0] = 0; alarm1.AMx[1] = 0;alarm1.AMx[2] = 1;alarm1.AMx[3] = 1;
			alarm1.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 min sec %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test hours, minutes and seconds match alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = 0;
			alarm1.minutes = 0;
			alarm1.hours = time1.hours+1;
			alarm1.am_pm = time1.am_pm;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day;
			alarm1.date = date1.date;
			alarm1.AMx[0] = 0; alarm1.AMx[1] = 0;alarm1.AMx[2] = 0;alarm1.AMx[3] = 1;
			alarm1.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 hr min sec %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test date, hours, minutes and seconds match alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 11;
			time1.is_ampm_time = 1;
			time1.am_pm = 1;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = 0;
			alarm1.minutes = 0;
			alarm1.hours = 12;
			alarm1.am_pm = 0;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day;
			alarm1.date = date1.date+1;
			alarm1.AMx[0] = 0; alarm1.AMx[1] = 0;alarm1.AMx[2] = 0;alarm1.AMx[3] = 0;
			alarm1.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 date hr min sec %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test day, hours, minutes and seconds match alarm 1
			DS3231_alarm_t alarm1;
			uint8_t alarm1_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 11;
			time1.is_ampm_time = 1;
			time1.am_pm = 1;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm1.seconds = 0;
			alarm1.minutes = 0;
			alarm1.hours = 12;
			alarm1.am_pm = 0;
			alarm1.is_ampm_time = time1.is_ampm_time;
			alarm1.day = date1.day+1;
			alarm1.date = date1.date+1;
			alarm1.AMx[0] = 0; alarm1.AMx[1] = 0;alarm1.AMx[2] = 0;alarm1.AMx[3] = 0;
			alarm1.day_or_date = DS3231_ALARM_DAY;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_1(I2Cx, alarm1);
			i2c_ds3231_check_alarm_1(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm1_state[0] = i2c_ds3231_check_alarm_1(I2Cx);
			delayms(300);
			alarm1_state[1] = i2c_ds3231_check_alarm_1(I2Cx);
			if(alarm1_state[0] != 0){
				result++;
			}if (alarm1_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm1 day hr min sec %d %d\r\n", alarm1_state[0],alarm1_state[1]);
				uart_OutString(USART2, buffer);
			}
		}


