dustinreynolds/STM32Examples/RTC_DS3231/src/i2c.c
		{ //Test once a minute alarm 2
			DS3231_alarm_t alarm2;
			uint8_t alarm2_state[2];

			time1.seconds = 59;
			time1.minutes = 2;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm2.minutes = time1.minutes+1;
			alarm2.hours = time1.hours;
			alarm2.am_pm = time1.am_pm;
			alarm2.is_ampm_time = time1.is_ampm_time;
			alarm2.day = date1.day;
			alarm2.date = date1.date;
			alarm2.AMx[1] = 1;alarm2.AMx[2] = 1;alarm2.AMx[3] = 1;
			alarm2.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_2(I2Cx, alarm2);
			i2c_ds3231_check_alarm_2(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm2_state[0] = i2c_ds3231_check_alarm_2(I2Cx);
			delayms(300);
			alarm2_state[1] = i2c_ds3231_check_alarm_2(I2Cx);
			if(alarm2_state[0] != 0){
				result++;
			}if (alarm2_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm2 once a minute %d %d\r\n", alarm2_state[0],alarm2_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test minutes match alarm 2
			DS3231_alarm_t alarm2;
			uint8_t alarm2_state[2];

			time1.seconds = 59;
			time1.minutes = 2;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm2.minutes = time1.minutes+1;
			alarm2.hours = time1.hours;
			alarm2.am_pm = time1.am_pm;
			alarm2.is_ampm_time = time1.is_ampm_time;
			alarm2.day = date1.day;
			alarm2.date = date1.date;
			alarm2.AMx[1] = 0;alarm2.AMx[2] = 1;alarm2.AMx[3] = 1;
			alarm2.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_2(I2Cx, alarm2);
			i2c_ds3231_check_alarm_2(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm2_state[0] = i2c_ds3231_check_alarm_2(I2Cx);
			delayms(300);
			alarm2_state[1] = i2c_ds3231_check_alarm_2(I2Cx);
			if(alarm2_state[0] != 0){
				result++;
			}if (alarm2_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm2 min %d %d\r\n", alarm2_state[0],alarm2_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test hours and minutes match alarm 2
			DS3231_alarm_t alarm2;
			uint8_t alarm2_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 9;
			time1.is_ampm_time = 0;
			time1.am_pm = 0;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm2.minutes = 0;
			alarm2.hours = time1.hours+1;
			alarm2.am_pm = time1.am_pm;
			alarm2.is_ampm_time = time1.is_ampm_time;
			alarm2.day = date1.day;
			alarm2.date = date1.date;
			alarm2.AMx[1] = 0;alarm2.AMx[2] = 0;alarm2.AMx[3] = 1;
			alarm2.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_2(I2Cx, alarm2);
			i2c_ds3231_check_alarm_2(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm2_state[0] = i2c_ds3231_check_alarm_2(I2Cx);
			delayms(300);
			alarm2_state[1] = i2c_ds3231_check_alarm_2(I2Cx);
			if(alarm2_state[0] != 0){
				result++;
			}if (alarm2_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm2 hr min %d %d\r\n", alarm2_state[0],alarm2_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test date hours and minutes match alarm 2
			DS3231_alarm_t alarm2;
			uint8_t alarm2_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 11;
			time1.is_ampm_time = 1;
			time1.am_pm = 1;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm2.minutes = 0;
			alarm2.hours = 12;
			alarm2.am_pm = 0;
			alarm2.is_ampm_time = time1.is_ampm_time;
			alarm2.day = date1.day;
			alarm2.date = date1.date+1;
			alarm2.AMx[1] = 0;alarm2.AMx[2] = 0;alarm2.AMx[3] = 0;
			alarm2.day_or_date = DS3231_ALARM_DATE;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_2(I2Cx, alarm2);
			i2c_ds3231_check_alarm_2(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm2_state[0] = i2c_ds3231_check_alarm_2(I2Cx);
			delayms(300);
			alarm2_state[1] = i2c_ds3231_check_alarm_2(I2Cx);
			if(alarm2_state[0] != 0){
				result++;
			}if (alarm2_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm2 date hr min %d %d\r\n", alarm2_state[0],alarm2_state[1]);
				uart_OutString(USART2, buffer);
			}
		}

		{ //Test date hours and minutes match alarm 2
			DS3231_alarm_t alarm2;
			uint8_t alarm2_state[2];

			time1.seconds = 59;
			time1.minutes = 59;
			time1.hours = 11;
			time1.is_ampm_time = 1;
			time1.am_pm = 1;
			date1.day = 1;
			date1.date = 14;
			date1.month = 6;
			date1.year = 15;

			alarm2.minutes = 0;
			alarm2.hours = 12;
			alarm2.am_pm = 0;
			alarm2.is_ampm_time = time1.is_ampm_time;
			alarm2.day = date1.day+1;
			alarm2.date = date1.date+1;
			alarm2.AMx[1] = 0;alarm2.AMx[2] = 0;alarm2.AMx[3] = 0;
			alarm2.day_or_date = DS3231_ALARM_DAY;

			i2c_ds3231_set_time_date(I2Cx, time1, date1);

			i2c_ds3231_set_alarm_2(I2Cx, alarm2);
			i2c_ds3231_check_alarm_2(I2Cx); //clear any existing alarm states

			//wait and check
			delayms(800);
			alarm2_state[0] = i2c_ds3231_check_alarm_2(I2Cx);
			delayms(300);
			alarm2_state[1] = i2c_ds3231_check_alarm_2(I2Cx);
			if(alarm2_state[0] != 0){
				result++;
			}if (alarm2_state[1] != 1){
				result++;
			}
			if (result > 0)
			{
				char buffer[30];
				sprintf(buffer, "alarm2 day hr min %d %d\r\n", alarm2_state[0],alarm2_state[1]);
				uart_OutString(USART2, buffer);
			}
		}
	}

	return result;
}

/**********************************************************************************************/
/* Private functions                                                                          */
/**********************************************************************************************/
void _i2c_start_address(I2C_TypeDef* I2Cx, uint8_t address, uint8_t I2C_Direction){
	I2C_GenerateSTART(I2Cx, ENABLE);
	while(!I2C_GetFlagStatus(I2Cx, I2C_FLAG_SB));

	I2C_AcknowledgeConfig(I2Cx, ENABLE);

	if (I2C_Direction == I2C_Direction_Transmitter){
		I2C_Send7bitAddress(I2Cx, address<<1, I2C_Direction_Transmitter);

		while(!(I2C_GetFlagStatus(I2Cx, I2C_FLAG_ADDR)));

	}else{
		I2C_Send7bitAddress(I2Cx, address<<1, I2C_Direction_Receiver);

		while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));
	}

	I2C_ReadRegister(I2Cx, I2C_Register_SR2);
}

void _i2c_stop(I2C_TypeDef* I2Cx){
	while(!I2C_GetFlagStatus(I2Cx, I2C_FLAG_TXE | I2C_FLAG_BTF));
	I2C_GenerateSTOP(I2Cx, ENABLE);
}

void _i2c_write(I2C_TypeDef* I2Cx, uint8_t byte){
	while (!I2C_GetFlagStatus(I2Cx,I2C_FLAG_TXE));
	I2C_SendData(I2Cx, byte);
}

void _i2c_read(I2C_TypeDef* I2Cx, uint8_t ack, uint8_t * byte){

	if (ack == ACK){
		I2Cx->CR1 |= I2C_CR1_ACK;
	}else{
		I2Cx->CR1 &= (uint16_t)~((uint16_t)I2C_CR1_ACK);
	}

	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED));

	*byte = I2C_ReceiveData(I2Cx);
}

